InformationRegisters/КотировкиВРеальномВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КотировкиВРеальномВремени</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПолучитьТекущиеЦены/Ext/Module.bsl
Функция ПолучитьЦены() Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Данные = Новый Массив;
	HTTPСоединение = Новый HTTPСоединение("iss.moex.com");
	Запрос = Новый HTTPЗапрос("/iss/engines/stock/markets/shares/boards/TQBR/securities.json?iss.meta=off&iss.only=marketdata&marketdata.columns=SECID,LAST");
	Попытка
		Ответ = HTTPСоединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			Данные = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
			Для Каждого Элемент ИЗ Данные.marketdata.data Цикл
				Стр = ТЗ.Добавить();
				Стр.Название = Элемент[0];
				Стр.Цена = Элемент[1];
			КонецЦикла;
			Элемент = Неопределено;
		КонецЕсли;
		Ответ = Неопределено;
	Исключение;
	КонецПопытки;
	Данные = Неопределено;
	HTTPСоединение = Неопределено;
	Запрос = Неопределено;
	Возврат ТЗ;
КонецФункции  

Процедура ИмпортТекущихЦенAccess() Экспорт
	
	ФайлБазы = Константы.ИмяФайлаЗагрузкиAccess.Получить();
	//СтрокаПодключения = "Driver={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=" + ФайлБазы; 
	//СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.4.0; Data Source=" + ФайлБазы + ";";
	//СтрокаПодключенияACE = "Provider=Microsoft.ACE.OLEDB.12.0; Data Source=" +  Файл + ";""";
	СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source="  + ФайлБазы;
	Connection = Новый COMОбъект("ADODB.Connection");
	Connection.Open(СтрокаПодключения);
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.ActiveConnection = Connection;
	Command.CommandText = "Select * FROM КурсыАкций";
	Command.CommandType = 1;
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet = Command.Execute();
	стр ="";
	МассивАкций = Новый Массив;
	Пока RecordSet.EOF() = 0 Цикл
		Для НомерПоля = 0 по  Recordset.Fields.Count -1 Цикл 
			ЗаписьКотировки = РегистрыСведений.КотировкиВРеальномВремени.СоздатьМенеджерЗаписи(); 
			Если НомерПоля = 4 Тогда 
				Дата = Recordset.Fields(НомерПоля).Value; 
				Время = Дата - НачалоДня(Дата); 
				ТекущаяяДатаСервера = ТекущаяДата();
				ДатаРаботыБиржы = ТекущаяяДатаСервера - 2*60*60;
				Период = НачалоДня(ДатаРаботыБиржы) + Время; 
			КонецЕсли;
			Если НомерПоля = 2 Тогда
				ТикерЗагрузки = Recordset.Fields(НомерПоля).Value;
				Акция = Справочники.Акции.НайтиПоРеквизиту("Тикер", ТикерЗагрузки);
				Если Акция = Справочники.Акции.ПустаяСсылка() Тогда
					Сообщить(НСтр("ru='Элемент справочника не найден. Добавте в справочник Акции новый элемент с тикером: '")+ ТикерЗагрузки);
				КонецЕсли;
			КонецЕсли;
			Если НомерПоля = 3 Тогда
				Цена = Recordset.Fields(НомерПоля).Value;
			КонецЕсли;
			Если НомерПоля =  Recordset.Fields.Count -1 Тогда
				ЗаписьКотировки.Период = Период;
				ЗаписьКотировки.Акция = Акция;
				ЗаписьКотировки.Цена = Цена;
				ЗаписьКотировки.Записать();
				МассивАкций.Добавить(Акция);
			КонецЕсли;
		КонецЦикла;
		RecordSet.MoveNext(); 
	КонецЦикла;
	RecordSet.Close();
	Connection.Close();  
	РаботаСЗаявками.ОбщийАлгоритмРаботыСЗаявками(МассивАкций);
КонецПроцедуры
